Terraform Plan for terraform/eus/dev/backend_asa:

```
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_postgresql_flexible_server.ops_dbs: Reading...
data.azurerm_key_vault.vault: Reading...
data.azurerm_storage_account.static_fe: Reading...
data.azurerm_key_vault.vault: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.KeyVault/vaults/opre-ops-dev-eus-core-kv]
data.azurerm_key_vault_secret.ops-jwt-private-key: Reading...
data.azurerm_key_vault_secret.ops-pw: Reading...
data.azurerm_container_app_environment.aca_env: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]
data.azurerm_storage_account.static_fe: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.Storage/storageAccounts/opreopsdeveussfest]
data.azurerm_key_vault_secret.ops-jwt-private-key: Read complete after 0s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-jwt-private-key/f4cec3a063e24ab1aba6dd83c63fbc0a]
data.azurerm_key_vault_secret.ops-pw: Read complete after 0s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-role-password/09ab85f39f0f4033bad60333fb584f93]
data.azurerm_postgresql_flexible_server.ops_dbs: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opre-ops-dev-eus-db-psql]
azurerm_container_app.backend: Refreshing state... [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/containerApps/opre-ops-dev-eus-be-ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.backend must be replaced
-/+ resource "azurerm_container_app" "backend" {
      ~ custom_domain_verification_id = (sensitive value)
      ~ id                            = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/containerApps/opre-ops-dev-eus-be-ca" -> (known after apply)
      ~ latest_revision_fqdn          = "opre-ops-dev-eus-be-ca--b159b54b.blackpond-5cf544be.eastus.azurecontainerapps.io" -> (known after apply)
      ~ latest_revision_name          = "opre-ops-dev-eus-be-ca--b159b54b" -> (known after apply)
      ~ location                      = "eastus" -> (known after apply)
      ~ name                          = "opre-ops-dev-eus-be-ca" -> "opre-ops-dev-eus-sbe-ca" # forces replacement
      ~ outbound_ip_addresses         = [
          - "52.188.141.165",
        ] -> (known after apply)
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ ingress {
          - exposed_port               = 0 -> null
          ~ fqdn                       = "opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ template {
          ~ revision_suffix = "b159b54b" -> "773108ea"
            # (2 unchanged attributes hidden)

          ~ container {
              - args              = [] -> null
              - command           = [] -> null
              ~ ephemeral_storage = "1Gi" -> (known after apply)
              ~ image             = "ghcr.io/hhs/opre-ops/ops-backend:b159b54b7f41075f26913766ab1b5ca2977f0c2d" -> "ghcr.io/hhs/opre-ops/ops-backend:773108ea870c981c2209cd2cd16e53aba201fe91"
                name              = "ops-backend"
                # (2 unchanged attributes hidden)

              ~ env {
                    name  = "OPS_FRONTEND_URL"
                  ~ value = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> "https://opreopsdeveussfest.z13.web.core.windows.net"
                }

                # (7 unchanged blocks hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ fe_domain = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> "https://opreopsdeveussfest.z13.web.core.windows.net"
```

Plan saved to GH artifacts.